cases/old/on-fsi-3/fluid/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// on-fsi-2 FLUIDO - 1 zona (CSF water-like, rho=1000, nu=1e-6).
// Anular do SAS r=1.55-2.35 mm, z=0-30 mm. 8 blocos hex (sas_in + sas_out).
// 5 patches:
//   inlet              z=0,  r=1.55-2.35  pressao P_CSF=1333 Pa (cisterna quiasmatica)
//   fsi_pia            r=1.55, z=0-30     noSlip movingWallVelocity (encosta na pia)
//   fsi_dura           r=2.35, z=0-30     noSlip movingWallVelocity (encosta na dura)
//   fsi_sclera_peri    z=30, r=1.55-2.00  noSlip movingWallVelocity (tampa peri)
//   fsi_sclera_ring    z=30, r=2.00-2.35  noSlip movingWallVelocity (tampa ring)
//
// Mesma indexacao de vertices do solid (4 z-levels, 6 layers) garantindo
// conformidade de malha nas 4 interfaces FSI.

scale   0.001;


vertices
(
    (    0.750000     0.750000    0.000 )  //   0
    (   -0.750000     0.750000    0.000 )  //   1
    (   -0.750000    -0.750000    0.000 )  //   2
    (    0.750000    -0.750000    0.000 )  //   3
    (    1.060660     1.060660    0.000 )  //   4
    (   -1.060660     1.060660    0.000 )  //   5
    (   -1.060660    -1.060660    0.000 )  //   6
    (    1.060660    -1.060660    0.000 )  //   7
    (    1.096016     1.096016    0.000 )  //   8
    (   -1.096016     1.096016    0.000 )  //   9
    (   -1.096016    -1.096016    0.000 )  //  10
    (    1.096016    -1.096016    0.000 )  //  11
    (    1.414214     1.414214    0.000 )  //  12
    (   -1.414214     1.414214    0.000 )  //  13
    (   -1.414214    -1.414214    0.000 )  //  14
    (    1.414214    -1.414214    0.000 )  //  15
    (    1.661701     1.661701    0.000 )  //  16
    (   -1.661701     1.661701    0.000 )  //  17
    (   -1.661701    -1.661701    0.000 )  //  18
    (    1.661701    -1.661701    0.000 )  //  19
    (    1.767767     1.767767    0.000 )  //  20
    (   -1.767767     1.767767    0.000 )  //  21
    (   -1.767767    -1.767767    0.000 )  //  22
    (    1.767767    -1.767767    0.000 )  //  23
    (    0.750000     0.750000   30.000 )  //  24
    (   -0.750000     0.750000   30.000 )  //  25
    (   -0.750000    -0.750000   30.000 )  //  26
    (    0.750000    -0.750000   30.000 )  //  27
    (    1.060660     1.060660   30.000 )  //  28
    (   -1.060660     1.060660   30.000 )  //  29
    (   -1.060660    -1.060660   30.000 )  //  30
    (    1.060660    -1.060660   30.000 )  //  31
    (    1.096016     1.096016   30.000 )  //  32
    (   -1.096016     1.096016   30.000 )  //  33
    (   -1.096016    -1.096016   30.000 )  //  34
    (    1.096016    -1.096016   30.000 )  //  35
    (    1.414214     1.414214   30.000 )  //  36
    (   -1.414214     1.414214   30.000 )  //  37
    (   -1.414214    -1.414214   30.000 )  //  38
    (    1.414214    -1.414214   30.000 )  //  39
    (    1.661701     1.661701   30.000 )  //  40
    (   -1.661701     1.661701   30.000 )  //  41
    (   -1.661701    -1.661701   30.000 )  //  42
    (    1.661701    -1.661701   30.000 )  //  43
    (    1.767767     1.767767   30.000 )  //  44
    (   -1.767767     1.767767   30.000 )  //  45
    (   -1.767767    -1.767767   30.000 )  //  46
    (    1.767767    -1.767767   30.000 )  //  47
    (    0.750000     0.750000   30.300 )  //  48
    (   -0.750000     0.750000   30.300 )  //  49
    (   -0.750000    -0.750000   30.300 )  //  50
    (    0.750000    -0.750000   30.300 )  //  51
    (    1.060660     1.060660   30.300 )  //  52
    (   -1.060660     1.060660   30.300 )  //  53
    (   -1.060660    -1.060660   30.300 )  //  54
    (    1.060660    -1.060660   30.300 )  //  55
    (    1.096016     1.096016   30.300 )  //  56
    (   -1.096016     1.096016   30.300 )  //  57
    (   -1.096016    -1.096016   30.300 )  //  58
    (    1.096016    -1.096016   30.300 )  //  59
    (    1.414214     1.414214   30.300 )  //  60
    (   -1.414214     1.414214   30.300 )  //  61
    (   -1.414214    -1.414214   30.300 )  //  62
    (    1.414214    -1.414214   30.300 )  //  63
    (    1.661701     1.661701   30.300 )  //  64
    (   -1.661701     1.661701   30.300 )  //  65
    (   -1.661701    -1.661701   30.300 )  //  66
    (    1.661701    -1.661701   30.300 )  //  67
    (    1.767767     1.767767   30.300 )  //  68
    (   -1.767767     1.767767   30.300 )  //  69
    (   -1.767767    -1.767767   30.300 )  //  70
    (    1.767767    -1.767767   30.300 )  //  71
    (    0.750000     0.750000   30.800 )  //  72
    (   -0.750000     0.750000   30.800 )  //  73
    (   -0.750000    -0.750000   30.800 )  //  74
    (    0.750000    -0.750000   30.800 )  //  75
    (    1.060660     1.060660   30.800 )  //  76
    (   -1.060660     1.060660   30.800 )  //  77
    (   -1.060660    -1.060660   30.800 )  //  78
    (    1.060660    -1.060660   30.800 )  //  79
    (    1.096016     1.096016   30.800 )  //  80
    (   -1.096016     1.096016   30.800 )  //  81
    (   -1.096016    -1.096016   30.800 )  //  82
    (    1.096016    -1.096016   30.800 )  //  83
    (    1.414214     1.414214   30.800 )  //  84
    (   -1.414214     1.414214   30.800 )  //  85
    (   -1.414214    -1.414214   30.800 )  //  86
    (    1.414214    -1.414214   30.800 )  //  87
    (    1.661701     1.661701   30.800 )  //  88
    (   -1.661701     1.661701   30.800 )  //  89
    (   -1.661701    -1.661701   30.800 )  //  90
    (    1.661701    -1.661701   30.800 )  //  91
    (    1.767767     1.767767   30.800 )  //  92
    (   -1.767767     1.767767   30.800 )  //  93
    (   -1.767767    -1.767767   30.800 )  //  94
    (    1.767767    -1.767767   30.800 )  //  95
);

blocks
(
    // ===== SAS annulus z=0-30 (8 blocos: sas_in + sas_out) =====
    hex (  11  15  12   8   35  39  36  32 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_in_E
    hex (   8  12  13   9   32  36  37  33 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_in_N
    hex (   9  13  14  10   33  37  38  34 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_in_W
    hex (  10  14  15  11   34  38  39  35 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_in_S
    hex (  15  19  16  12   39  43  40  36 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_out_E
    hex (  12  16  17  13   36  40  41  37 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_out_N
    hex (  13  17  18  14   37  41  42  38 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_out_W
    hex (  14  18  19  15   38  42  43  39 )  sas          ( 3 8 30 )  simpleGrading ( 1 1 1 )  // sas_out_S
);

edges
(
    // ---- pia     r=1.55  @ z=0.000 mm ----
    arc   8  11  (   1.55000    0.00000    0.000 )
    arc   8   9  (   0.00000    1.55000    0.000 )
    arc   9  10  (  -1.55000    0.00000    0.000 )
    arc  10  11  (   0.00000   -1.55000    0.000 )
    // ---- sas_mid r=2.00  @ z=0.000 mm ----
    arc  12  15  (   2.00000    0.00000    0.000 )
    arc  12  13  (   0.00000    2.00000    0.000 )
    arc  13  14  (  -2.00000    0.00000    0.000 )
    arc  14  15  (   0.00000   -2.00000    0.000 )
    // ---- sas     r=2.35  @ z=0.000 mm ----
    arc  16  19  (   2.35000    0.00000    0.000 )
    arc  16  17  (   0.00000    2.35000    0.000 )
    arc  17  18  (  -2.35000    0.00000    0.000 )
    arc  18  19  (   0.00000   -2.35000    0.000 )

    // ---- pia     r=1.55  @ z=30.000 mm ----
    arc  32  35  (   1.55000    0.00000   30.000 )
    arc  32  33  (   0.00000    1.55000   30.000 )
    arc  33  34  (  -1.55000    0.00000   30.000 )
    arc  34  35  (   0.00000   -1.55000   30.000 )
    // ---- sas_mid r=2.00  @ z=30.000 mm ----
    arc  36  39  (   2.00000    0.00000   30.000 )
    arc  36  37  (   0.00000    2.00000   30.000 )
    arc  37  38  (  -2.00000    0.00000   30.000 )
    arc  38  39  (   0.00000   -2.00000   30.000 )
    // ---- sas     r=2.35  @ z=30.000 mm ----
    arc  40  43  (   2.35000    0.00000   30.000 )
    arc  40  41  (   0.00000    2.35000   30.000 )
    arc  41  42  (  -2.35000    0.00000   30.000 )
    arc  42  43  (   0.00000   -2.35000   30.000 )

);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (  11  15  12   8 )   // sas_in_E
            (   8  12  13   9 )   // sas_in_N
            (   9  13  14  10 )   // sas_in_W
            (  10  14  15  11 )   // sas_in_S
            (  15  19  16  12 )   // sas_out_E
            (  12  16  17  13 )   // sas_out_N
            (  13  17  18  14 )   // sas_out_W
            (  14  18  19  15 )   // sas_out_S
        );
    }

    fsi_pia
    {
        type wall;
        faces
        (
            (  11   8  32  35 )   // fsi_pia_E
            (   8   9  33  32 )   // fsi_pia_N
            (   9  10  34  33 )   // fsi_pia_W
            (  10  11  35  34 )   // fsi_pia_S
        );
    }

    fsi_dura
    {
        type wall;
        faces
        (
            (  19  16  40  43 )   // fsi_dura_E
            (  16  17  41  40 )   // fsi_dura_N
            (  17  18  42  41 )   // fsi_dura_W
            (  18  19  43  42 )   // fsi_dura_S
        );
    }

    fsi_sclera_peri
    {
        type wall;
        faces
        (
            (  35  39  36  32 )   // fsi_sclera_peri_E
            (  32  36  37  33 )   // fsi_sclera_peri_N
            (  33  37  38  34 )   // fsi_sclera_peri_W
            (  34  38  39  35 )   // fsi_sclera_peri_S
        );
    }

    fsi_sclera_ring
    {
        type wall;
        faces
        (
            (  39  43  40  36 )   // fsi_sclera_ring_E
            (  36  40  41  37 )   // fsi_sclera_ring_N
            (  37  41  42  38 )   // fsi_sclera_ring_W
            (  38  42  43  39 )   // fsi_sclera_ring_S
        );
    }

);

